//
// 浮點數示例
// Created by leisurexi on 2020/7/31.
//

#include "binary-utils.h"

// 浮点数規格值真实值运算公式: V = (-1) ^ s * (1 + M) * 2 ^ E
// E = e - Bias，e 爲指數的無符號表示形式， Bias float 爲 127，double 爲 1023

// 浮點數機器值轉換爲真值
void binary_to_float() {
    // S    E              M
    // 1 01111101 11000000000000000000000
    // E = 125 - 127 = -2
    // M = 0.11000000000000000000000 = 1 * 2 ^ -1 + 1 * 2 ^ -2 + 0 * 2 ^ -3 ... = 0.75
    // V = (-1) ^ -1 * (1 + 0.75) * 2 ^ -2
    //   = -0.4375
}


// 浮點數轉換爲二進制過程示例
void float_to_binary() {
    float n = -12.75;
    // -12.75 拆分爲二進制表示
    // -12 = 1100
    // 0.75 = 2 ^ -1 + 2 ^ -2 = 0.11
    // -12.75 = -1100.11B
    //        = -1.10011B * 2 ^ 3
    // 符號 s = 1
    // 階碼 E = 127 + 3 = 128 + 2 = 10000010
    // 尾數 M = 10011000000000000000000
    // 1 10000010 11001100000000000000000
    print_binary(sizeof(float), &n);
}

// 浮点数加法
// 十进制小数转换为二级制小数参考: https://www.cnblogs.com/xkfz007/articles/2590472.html
void float_add() {
    float a = 0.5;
    float b = -0.4375;
    // a 拆分为二进制表示，规格化形式，小数点前面必须有个1
    // 0.5 = 0.1
    //     = 1.000 * 2 ^ -1
    // b 拆分为二级制表示
    // -0.4375 = -0.0111
    //         = -1.1110 * 2 ^ -2
    // 对阶: 小阶向大阶看齐
    // a = 1.000 * 2 ^ -1   b = -0.111 * 2 ^ -1
    // 尾数加减: 1.000 * 2 ^ -1 + (-0.111 * 2 ^ -1) = 0.001 * 2 ^ -1
    // 尾数加减后的值时非规格化的值，因为小数点前面不是1，所以要进行左规
    // 左规: 1.000 * 2 ^ -4
    // 十进制表示: 1.000 * 2 ^ -4 = 0.0001 = 1 / 16 = 0.0625
    // 二进制表示: 0 01111011 10000000000000000000000
    float c = a + b;
    printf("%f\n", c);
    print_binary(sizeof(float), &c);
}

int main() {
//    float_to_binary();
    // 浮点数加法
    float_add();
    return 0;
}
