//
// 浮點數示例
// Created by leisurexi on 2020/7/31.
//

#include "binary-utils.h"

// 浮点数規格值真实值运算公式: V = (-1) ^ s * (1 + M) * 2 ^ E
// E = e - Bias，e 爲指數的無符號表示形式， Bias float 爲 127，double 爲 1023

// 浮點數機器值轉換爲真值
void binaryToFloat() {
    // S    E              M
    // 1 01111101 11000000000000000000000
    // E = 125 - 127 = -2
    // M = 0.11000000000000000000000 = 1 * 2 ^ -1 + 1 * 2 ^ -2 + 0 * 2 ^ -3 ... = 0.75
    // V = (-1) ^ -1 * (1 + 0.75) * 2 ^ -2
    //   = -0.4375
}


// 浮點數轉換爲二進制過程示例
void floatToBinary() {
    float n = -12.75;
    // -12.75 拆分爲二進制表示
    // -12 = 1100
    // 0.75 = 2 ^ -1 + 2 ^ -2 = 0.11
    // -12.75 = -1100.11B
    //        = -1.10011B * 2 ^ 3
    // 符號 s = 1
    // 階碼 E = 127 + 3 = 128 + 2 = 10000010
    // 尾數 M = 10011000000000000000000
    // 1 10000010 11001100000000000000000
    print_binary(sizeof(float), &n);
}

int main() {
    floatToBinary();
    return 0;
}
